// heroData.js

const heroData = {
  "파스칼": {
    역할: "Dealer1",
    태그: ["복수자"],
    세트옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률"],
    추옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률"],
    비고: ""
  },
  "에스파다": {
    역할: "Dealer1",
    태그: ["복수자"],
    세트옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률"],
    추옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률"],
    비고: ""
  },
  "세인": {
    역할: "Dealer1",
    태그: ["복수자"],
    세트옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률"],
    추옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률"],
    비고: ""
  },
  "발리스타":{
    역할: "Dealer1",
    태그: ["복수자"],
    세트옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률"],
    추옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률"],
    비고: ""
  },
  "타카":{
    역할: "Dealer1",
    태그: ["복수자"],
    세트옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률"],
    추옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률"],
    비고: ""
  },
  "루리":{
    역할: "Dealer1",
    태그: ["복수자"],
    세트옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률"],
    추옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률"],
    비고: ""
  },
  "비담":{
    역할: "Dealer1",
    태그: ["복수자"],
    세트옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률"],
    추옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률"],
    비고: ""
  },
  "태오": {
    역할: "Dealer2",
    태그: ["복수자", "암살자"],
    세트옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)"],
    추옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률", "속공"],
    비고: "6초월 이상일 경우 주옵 치명타 피해 우선"
  },
  "벨리카":{
    역할: "Dealer2",
    태그: ["복수자", "암살자"],
    세트옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)"],
    추옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률", "속공"],
    비고: ""
  },
  "실베스타":{
    역할: "Dealer2",
    태그: ["복수자", "암살자"],
    세트옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)"],
    추옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률", "속공"],
    비고: ""
  },
  "연희":{
    역할: "Dealer2",
    태그: ["복수자", "암살자"],
    세트옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)"],
    추옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률", "속공"],
    비고: ""
  },
  "델론즈":{
    역할: "Dealer1",
    태그: ["복수자", "암살자"],
    세트옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)"],
    추옵션: ["치명타 확률", "치명타 피해", "모든 공격력(%)", "약점 공격 확률", "속공"],
    비고: "2초월 미만 시 효과적중 or 수문장, 2초월 이상 시 추적자 세팅"
  },
  "제이브": {
    역할: "Tank",
    태그: ["복수자", "주술사", "수문장"],
    세트옵션: ["모든 공격력(%)", "생명력(%)", "방어력(%)", "효과적중(%)", "막기확률(%)", "받는 피해 감소"],
    추옵션: ["치명타 확률", "모든 공격력(%)", "막기 확률", "생명력(%)"],
    비고: "사용 목적(딜러/탱커/쫄작 등)에 따라 세팅 변경, 쫄작 시 치명타 확률 100% 필수"
  },
  "에반":{
    역할: "Tank",
    태그: ["수문장", "수호자", "조율자"],
    세트옵션: ["방어력(%)", "생명력(%)", "막기 확률(%)", "받는 피해 감소"],
    추옵션: ["방어력(%)", "막기 확률", "생명력(%)"],
    비고: ""
  },
  "루디":{
    역할: "Tank",
    태그: ["수문장", "수호자", "조율자"],
    세트옵션: ["방어력(%)", "생명력(%)", "막기 확률(%)", "받는 피해 감소"],
    추옵션: ["방어력(%)", "막기 확률", "생명력(%)"],
    비고: ""
  },
  "챈슬러":{
    역할: "Tank",
    태그: ["수문장", "수호자", "조율자"],
    세트옵션: ["방어력(%)", "생명력(%)", "막기 확률(%)", "받는 피해 감소"],
    추옵션: ["방어력(%)", "막기 확률", "생명력(%)"],
    비고: ""
  },
  "룩":{
    역할: "Tank",
    태그: ["수문장", "수호자", "조율자"],
    세트옵션: ["방어력(%)", "생명력(%)", "막기 확률(%)", "받는 피해 감소"],
    추옵션: ["방어력(%)", "막기 확률", "생명력(%)"],
    비고: ""
  },
  "아라곤":{
    역할: "Tank",
    태그: ["수문장", "수호자", "조율자"],
    세트옵션: ["방어력(%)", "생명력(%)", "막기 확률(%)", "받는 피해 감소"],
    추옵션: ["방어력(%)", "막기 확률", "생명력(%)"],
    비고: ""
  },
  "리나":{
    역할: "Healer",
    태그: ["수문장", "성기사"],
    세트옵션: ["생명력(%)", "막기 확률", "받는 피해 감소"],
    추옵션: ["생명력(%)", "막기 확률", "생명력(%)"],
    비고: ""
  },
  "유이":{
    역할: "Healer",
    태그: ["수문장", "성기사"],
    세트옵션: ["생명력(%)", "막기 확률", "받는 피해 감소"],
    추옵션: ["생명력(%)", "막기 확률", "방어력(%)"],
    비고: ""
  },
  "엘리스":{
    역할: "Healer",
    태그: ["수문장", "성기사"],
    세트옵션: ["생명력(%)", "막기 확률", "받는 피해 감소"],
    추옵션: ["생명력(%)", "막기 확률", "방어력(%)"],
    비고: ""
  },
  "아일린": {
    역할: "Debuffer",
    태그: ["수문장", "주술사"],
    세트옵션: ["효과적중", "생명력(%)", "방어력(%)", "모든 공격력(%)", "막기확률(%)", "받는 피해 감소"],
    추옵션: ["막기확률", "속공", "효과적중", "생명력(%)", "방어력(%)"],
    비고: ""
  },
  "유신": {
    역할: "Debuffer",
    태그: ["수문장", "주술사"],
    세트옵션: ["효과적중", "생명력(%)", "방어력(%)", "모든 공격력(%)", "막기확률(%)", "받는 피해 감소"],
    추옵션: ["막기확률", "속공", "효과적중", "생명력(%)", "방어력(%)"],
    비고: ""
  },
  "바네사": {
    역할: "Debuffer",
    태그: ["수문장", "주술사"],
    세트옵션: ["효과적중", "생명력(%)", "방어력(%)", "모든 공격력(%)", "막기확률(%)", "받는 피해 감소"],
    추옵션: ["막기확률", "속공", "효과적중", "생명력(%)", "방어력(%)"],
    비고: "스킬 강화 및 초월 상황에 따라 딜러 세팅 가능"
  },
  "스파이크": {
    역할: "Debuffer",
    태그: ["수문장", "주술사"],
    세트옵션: ["효과적중", "생명력(%)", "방어력(%)", "모든 공격력(%)", "막기확률(%)", "받는 피해 감소"],
    추옵션: ["막기확률", "속공", "효과적중", "생명력(%)", "방어력(%)"],
    비고: ""
  },
  "니아": {
    역할: "Debuffer",
    태그: ["수문장", "주술사"],
    세트옵션: ["효과적중", "생명력(%)", "방어력(%)", "모든 공격력(%)", "막기확률(%)", "받는 피해 감소"],
    추옵션: ["막기확률", "속공", "효과적중", "생명력(%)", "방어력(%)"],
    비고: ""
  },
  "크리스": {
    역할: "Debuffer",
    태그: ["수문장", "주술사"],
    세트옵션: ["생명력(%)", "효과적중", "막기확률", "받는 피해 감소"],
    추옵션: ["효과적중", "생명력(%)", "방어력(%)", "막기확률", "속공"],
    비고: ""
  },
  "녹스": {
    역할: "Debuffer",
    태그: ["수문장", "주술사"],
    세트옵션: ["생명력(%)", "효과적중", "막기확률", "받는 피해 감소"],
    추옵션: ["효과적중", "생명력(%)", "방어력(%)", "막기확률", "속공"],
    비고: ""
  },
  "에이스": {
    역할: "Totem",
    태그: ["수문장"],
    세트옵션: ["생명력(%)", "방어력(%)", "막기확률", "받는 피해 감소"],
    추옵션: ["막기확률", "속공", "생명력(%)", "방어력(%)"],
    비고: ""
  },
  "레이첼": {
    역할: "Debuffer",
    태그: ["수문장", "주술사"],
    세트옵션: ["효과적중", "생명력(%)", "방어력(%)", "모든 공격력(%)", "막기확률(%)", "받는 피해 감소"],
    추옵션: ["막기확률", "속공", "효과적중", "생명력(%)", "방어력(%)"],
    비고: ""
  },  
  "블랙로즈": {
    역할: "Totem",
    태그: ["수문장"],
    세트옵션: ["생명력(%)", "방어력(%)", "막기확률", "받는 피해 감소"],
    추옵션: ["막기확률", "속공", "생명력(%)", "방어력(%)"],
    비고: ""
  },
  "카론": {
    역할: "Totem",
    태그: ["수문장"],
    세트옵션: ["생명력(%)", "방어력(%)", "막기확률", "받는 피해 감소"],
    추옵션: ["막기확률", "속공", "생명력(%)", "방어력(%)"],
    비고: ""
  },
  "빅토리아": {
    역할: "Totem",
    태그: ["수문장"],
    세트옵션: ["생명력(%)", "방어력(%)", "막기확률", "받는 피해 감소"],
    추옵션: ["막기확률", "속공", "생명력(%)", "방어력(%)"],
    비고: ""
  },
  "루시": {
    역할: "Totem",
    태그: ["수문장"],
    세트옵션: ["생명력(%)", "방어력(%)", "막기확률", "받는 피해 감소"],
    추옵션: ["막기확률", "속공", "생명력(%)", "방어력(%)"],
    비고: ""
  },
  "아수라": {
    역할: "Totem",
    태그: ["수문장"],
    세트옵션: ["생명력(%)", "방어력(%)", "막기확률", "받는 피해 감소"],
    추옵션: ["막기확률", "속공", "생명력(%)", "방어력(%)"],
    비고: ""
  },
  "레오": {
    역할: "Totem",
    태그: ["수문장"],
    세트옵션: ["생명력(%)", "방어력(%)", "막기확률", "받는 피해 감소"],
    추옵션: ["막기확률", "속공", "생명력(%)", "방어력(%)"],
    비고: ""
  }
};
